Work Project 3/app/controllers/candidate_details_controller.rb

SELECT "candidate_details".* FROM "candidate_details"
---
  def index
    @candidate_details = CandidateDetail.all

INSERT INTO "candidate_details" ("s_no", "src_reg", "zone", "DOR", "reg_no", "name", "gender", "age", "address", "branch", "email", "contact_no", "state", "qualification", "specialization", "experience", "remark_mobility", "DOC", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @candidate_detail = CandidateDetail.new(candidate_detail_params)

    respond_to do |format|
      if @candidate_detail.save

UPDATE "candidate_details" SET "contact_no" = ?, "state" = ?, "updated_at" = ? WHERE "candidate_details"."id" = ?  [["contact_no", 7024345678], ["state", "Utt"], ["updated_at", "2019-06-19 07:41:55.547750"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @candidate_detail.update(candidate_detail_params)

SELECT  "candidate_details".* FROM "candidate_details" WHERE "candidate_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_candidate_detail
      @candidate_detail = CandidateDetail.find(params[:id])